app/controllers/authors_controller.rb

INSERT INTO "authors" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Thu, 21 Feb 2013 20:03:08 UTC +00:00], ["name", "Henrique Silva"], ["updated_at", Thu, 21 Feb 2013 20:03:08 UTC +00:00]]
---
  def create
    @author = Author.new(params[:author])

    respond_to do |format|
      if @author.save

SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", "1"]]
---
  def update
    @author = Author.find(params[:id])

SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "authors" WHERE "authors"."id" = ?  [["id", 2]]
---
  def destroy
    @author = Author.find(params[:id])
    @author.destroy