app/controllers/categories_controller.rb

INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Thu, 21 Feb 2013 20:03:29 UTC +00:00], ["name", "Bateria"], ["updated_at", Thu, 21 Feb 2013 20:03:29 UTC +00:00]]
---
  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save