gripspotnews/app/controllers/posts_controller.rb

  def new
    @post = Post.new
    @authors = Author.all
    @categories = Category.all
---
SELECT "authors".* FROM "authors"
SELECT "categories".* FROM "categories"

  def edit
    @post = Post.find(params[:id])
    @authors = Author.all
    @categories = Category.all
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "authors".* FROM "authors"
SELECT "categories".* FROM "categories"

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("author_id", "category_id", "content", "created_at", "photo_content_type", "photo_file_name", "photo_file_size", "photo_updated_at", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "posts" SET "photo_file_name" = 'MobRules.jpg', "photo_content_type" = 'image/jpeg', "photo_file_size" = 872996, "photo_updated_at" = '2013-03-09 06:04:11.248395', "updated_at" = '2013-03-09 06:04:11.250849' WHERE "posts"."id" = 1